{"class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 200, 10], "dtype": "float32", "sparse": false, "ragged": false, "name": "lidar_input"}, "registered_name": null, "name": "lidar_input", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "lidar_conv1", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 20, 200, 10], "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 20, 200, 10]}, "name": "lidar_conv1", "inbound_nodes": [[["lidar_input", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "lidar_conv2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 20, 200, 32]}, "name": "lidar_conv2", "inbound_nodes": [[["lidar_conv1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "lidar_conv3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 20, 200, 32]}, "name": "lidar_conv3", "inbound_nodes": [[["lidar_conv2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "lidar_add1", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 20, 200, 32], [null, 20, 200, 32]]}, "name": "lidar_add1", "inbound_nodes": [[["lidar_conv3", 0, 0, {}], ["lidar_conv1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "lidar_maxpool1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 20, 200, 32]}, "name": "lidar_maxpool1", "inbound_nodes": [[["lidar_add1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "lidar_dropout1", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 10, 100, 32]}, "name": "lidar_dropout1", "inbound_nodes": [[["lidar_maxpool1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "lidar_conv4", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 10, 100, 32]}, "name": "lidar_conv4", "inbound_nodes": [[["lidar_dropout1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "lidar_conv5", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 10, 100, 32]}, "name": "lidar_conv5", "inbound_nodes": [[["lidar_conv4", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "lidar_add2", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 10, 100, 32], [null, 10, 100, 32]]}, "name": "lidar_add2", "inbound_nodes": [[["lidar_conv5", 0, 0, {}], ["lidar_dropout1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "lidar_maxpool2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 10, 100, 32]}, "name": "lidar_maxpool2", "inbound_nodes": [[["lidar_add2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "lidar_dropout2", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 5, 50, 32]}, "name": "lidar_dropout2", "inbound_nodes": [[["lidar_maxpool2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "lidar_conv6", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 5, 50, 32]}, "name": "lidar_conv6", "inbound_nodes": [[["lidar_dropout2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "lidar_conv7", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 5, 50, 32]}, "name": "lidar_conv7", "inbound_nodes": [[["lidar_conv6", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "lidar_add3", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 5, 50, 32], [null, 5, 50, 32]]}, "name": "lidar_add3", "inbound_nodes": [[["lidar_conv7", 0, 0, {}], ["lidar_dropout2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "lidar_maxpool3", "trainable": true, "dtype": "float32", "pool_size": [1, 2], "padding": "valid", "strides": [1, 2], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 5, 50, 32]}, "name": "lidar_maxpool3", "inbound_nodes": [[["lidar_add3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "lidar_dropout3", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 5, 25, 32]}, "name": "lidar_dropout3", "inbound_nodes": [[["lidar_maxpool3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "lidar_conv8", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 5, 25, 32]}, "name": "lidar_conv8", "inbound_nodes": [[["lidar_dropout3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "lidar_conv9", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 5, 25, 32]}, "name": "lidar_conv9", "inbound_nodes": [[["lidar_conv8", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "lidar_add4", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 5, 25, 32], [null, 5, 25, 32]]}, "name": "lidar_add4", "inbound_nodes": [[["lidar_conv9", 0, 0, {}], ["lidar_dropout3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "lidar_flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 5, 25, 32]}, "name": "lidar_flatten", "inbound_nodes": [[["lidar_add4", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "lidar_dense1", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L1L2", "config": {"l1": 9.999999747378752e-06, "l2": 9.999999747378752e-05}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 4000]}, "name": "lidar_dense1", "inbound_nodes": [[["lidar_flatten", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "lidar_dropout4", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 512]}, "name": "lidar_dropout4", "inbound_nodes": [[["lidar_dense1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "lidar_dense2", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L1L2", "config": {"l1": 9.999999747378752e-06, "l2": 9.999999747378752e-05}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 512]}, "name": "lidar_dense2", "inbound_nodes": [[["lidar_dropout4", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "lidar_dropout5", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256]}, "name": "lidar_dropout5", "inbound_nodes": [[["lidar_dense2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "lidar_dense_out", "trainable": true, "dtype": "float32", "units": 256, "activation": "tanh", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256]}, "name": "lidar_dense_out", "inbound_nodes": [[["lidar_dropout5", 0, 0, {}]]]}], "input_layers": [["lidar_input", 0, 0]], "output_layers": [["lidar_dense_out", 0, 0]]}, "keras_version": "2.13.1", "backend": "tensorflow"}